{"/":{"title":"Get Started","data":{"":"","quick-start-with-nextjs#Quick Start with Next.js":"Install the library\n\n\n\n\nnpm i @comfortdelgro/react-workbench\n\n\n\nyarn add @comfortdelgro/react-workbench\n\n\n\npnpm add @comfortdelgro/react-workbench\n\n\n\nAdd preflight flushing styles for SSR.\n\n\nimport Preflight from '@comfortdelgro/react-workbench/preflight'\nimport Document, {\nDocumentContext,\nHead,\nHtml,\nMain,\nNextScript,\n} from 'next/document'\n\nclass MyDocument extends Document {\nstatic async getInitialProps(ctx: DocumentContext) {\nconst initialProps = await Document.getInitialProps(ctx)\nreturn {\n...initialProps,\nstyles: <>{initialProps.styles}</>,\n}\n}\n\nrender() {\nreturn (\n<Html>\n<Head>{Preflight.flush()}</Head>\n<body>\n<Main />\n<NextScript />\n</body>\n</Html>\n)\n}\n}\n\nexport default MyDocument\n\nAdd Preflight component for better CSS resets according to design guidelines.\n\n\nimport Preflight from '@comfortdelgro/react-workbench/preflight'\nimport {AppProps} from 'next/app'\n\nconst App: React.FC<AppProps> = ({Component, pageProps}) => {\nreturn (\n<>\n<Preflight />\n<Component {...pageProps} />\n</>\n)\n}\n\nexport default App\n\nYou are good to go!\n\n\nYou can opt out of step 3 but we'd recommend not to."}},"/components/alerts":{"title":"Alerts","data":{"":"Alerts provide short, timely, and relevant information for your users.\nDue to a bug, some components can't be displayed here. Check back again later.\nOr use ladle for now."}},"/components/avatars":{"title":"Avatars","data":{"":"Avatars help to distinguish between different entity types (person, organization, user, team).\nDue to a bug, some components can't be displayed here. Check back again later.\nOr use ladle for now."}},"/components/badges":{"title":"Badges","data":{"":"Badges can be used to highlight important bits of information such as labels, notifications, data trends & status.\nDue to a bug, some components can't be displayed here. Check back again later.\nOr use ladle for now."}},"/components/breadcrumbs":{"title":"Breadcrumbs","data":{"":"Breadcrumbs help users to navigate and understand where they are on the current website or portal.\nDue to a bug, some components can't be displayed here. Check back again later.\nOr use ladle for now."}},"/components/buttons":{"title":"Buttons","data":{"":"Buttons communicate actions that users can take to trigger events.\nDue to a bug, some components can't be displayed here. Check back again later.\nOr use ladle for now."}},"/components/inputs":{"title":"Inputs","data":{"":"Due to a bug, some components can't be displayed here. Check back again later.\nOr use ladle for now."}},"/components/spinners":{"title":"Spinners","data":{"":"Loading communicate to users the various states of processing.\nDue to a bug, some components can't be displayed here. Check back again later.\nOr use ladle for now."}},"/components/textareas":{"title":"Textareas","data":{"":"Textarea is used for inputting multiple lines of text.\nDue to a bug, some components can't be displayed here. Check back again later.\nOr use ladle for now."}},"/design/colors":{"title":"Colors","data":{"":"Color distinguishes a brand. It is used to convey personality, attracts the eye and indicate change.","palette#Palette":"","primary-colors#Primary Colors":"ComfortDelgro color palette has been created to reflect the spirit of our brand. Blue is used across all our communication as an essential element of branding. Primary color is the color displayed most frequently across your app's screens and components.Black is used primarily for body text and headings, and White is used for screen backgrounds and negative space.\nMain Colors\n\n\n\n\n\n\n\n\n\n\nText Colors\n\n\n\n\n\n\n\n\n\n\n\n\nDividers & Borders","secondary-colors#Secondary Colors":"Secondary color provides more ways to accent and distinguish our product. Each color is selected with purpose in order to provide meaningful feedback within our products. Secondary colors can also be used to create unique secondary brands for each one of ComfortDelgro products.","shades--tints#Shades & Tints":"We intend for tints and shades to be ever evolving, offering an endless palette to choose from. Usage of these colors varies depending on scenarios, but they come in handy for components in our products.\nTheme\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOverlays\n\n\n\n\n\n\n\n\nGrays\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBackgrounds","rules#Rules":"","accessibility#Accessibility":"All our product user interface should meet minimum WCAG AA level contrast guidelines. Low contrast can be problematic for people with lower vision, color blindness or even in non-optimal conditions (outdoor, bright sunlight).","contrast-ratio#Contrast Ratio":"All colors in this section are marked with their contrast ratio against White. If you use these colors on any other background or use these as background with text other than White, you will need to calculate these ratios again.The minimum required contrast ration depends on the text size and weight. To mantain WCAG AA level of contrast ratio, colors are required to be at least 4.5:1 for normal text and 3:1 for large text, and 3:1 for graphics and user interface components (such as form input borders), with exception to text or images of text that are part of an inactive user interface component (disabled states).","rag-red-amber-and-green#RAG (Red, Amber, and Green)":"This palette should only be used to convey status or meaning for messages and feedback. For contexts such as selecting risk, the full RAG palette can be used to reinforce positivity or negativity of the user’s choice."}},"/design/typography":{"title":"Typography","data":{"":"Good typography can help create clear hierarchies, organize information, and guide users through a product or experience.","fonts#Fonts":"Poppin is the primary digital product typeface of Pax app for both iOS and AOS.\nNative OS System feedback will use Roboto for AOS, and SF Sans Pro for IOS.","weights#Weights":"The choice of font weight is also based on the principles of order, stability, and restraint. In most cases, just regular and bold should be enough.","sizes#Sizes":"","display#Display":"","header#Header":"","body#Body":"You can use semibold and bold font weights on these font sizes for emphasises.","labels#Labels":"You can use light, medium and semibold font weights on these font sizes for emphasises.","links#Links":"See Link component reference."}}}